SO/Scenario 1.8/SO_24_Get_SO_Upload_Items_Error_By_History_Id.yaml
config:
  target: "https://moonlay-api.dbo.dev"
  phases:
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
scenarios:
  - flow:
      - get: 
          url: "/order-srv/upload-histories/0000282b4174b8a9009d91fe/error-items"
          headers:
            Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="