SO/Scenario 1.8/SO_32_Create_Retry_Process_For_SO_Sync_To_Kafka.yaml
config:
  target: "https://moonlay-api.dbo.dev"
  phases:
     - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
scenarios:
  - flow:
      - get: 
          url: "/order-srv/sales-orders/sosj/retry-to-sync-kafka/63fc5569f99ab6f27eb5de70"
          headers:
            Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="